test/template/upload-file-template.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gs="cn.cruder.bootsoap.namespace">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:uploadFileRequest>
            <!--      {name}只是占位      -->
            <gs:name>{name}</gs:name>
            <!--      {file}只是占位      -->
            <gs:file>{file}</gs:file>
        </gs:uploadFileRequest>
    </soapenv:Body>
</soapenv:Envelope>